# Answering Business Questions using SQL

After starting a business of fictional digital music shop kind of like a mini-iTunes store, it's the moment to use our data to have some answers about the business. The database contains information about the artists, songs, and albums from the music shop, as well as information on the shop's employees, customers, and the customers purchases and it's SQLite datebase . For this project we're going to use *SQL*, this is the schema diagram of the database we're going to work on : ![database](schema.png)

## 1. Overview of the Data

In [4]:
%%capture
%load_ext sql
%sql sqlite:///chinook.db

In [5]:
%%sql
SELECT 
    name,
    type
FROM sqlite_master
WHERE type IN ("table","view");

 * sqlite:///chinook.db
Done.

[('album', 'table'),
 ('artist', 'table'),
 ('customer', 'table'),
 ('employee', 'table'),
 ('genre', 'table'),
 ('invoice', 'table'),
 ('invoice_line', 'table'),
 ('media_type', 'table'),
 ('playlist', 'table'),
 ('playlist_track', 'table'),
 ('track', 'table')]

In [6]:
%%sql
SELECT * FROM customer LIMIT 5

 * sqlite:///chinook.db
Done.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3),
 (2, 'Leonie', 'Köhler', None, 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', '+49 0711 2842222', None, 'leonekohler@surfeu.de', 5),
 (3, 'François', 'Tremblay', None, '1498 rue Bélanger', 'Montréal', 'QC', 'Canada', 'H2G 1A7', '+1 (514) 721-4711', None, 'ftremblay@gmail.com', 3),
 (4, 'Bjørn', 'Hansen', None, 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', '+47 22 44 22 22', None, 'bjorn.hansen@yahoo.no', 4),
 (5, 'František', 'Wichterlová', 'JetBrains s.r.o.', 'Klanova 9/506', 'Prague', None, 'Czech Republic', '14700', '+420 2 4172 5555', '+420 2 4172 5555', 'frantisekw@jetbrains.com', 4)]

## 2.Selecting Albums to purchase

We have a deal with a new record label, it's specializes in artist from USA. They give us some money to advertise the new albums in the USA and you've been tasked with selecting the first three albums that will be added to the store. Right now, the 4 albums are by the artist don't have any track in our store , we have just the artist's name and the genre of music:

| Artist Name | Genre |
| --- | ----------- |
| Regal | Hip-Hop |
| Red Tone | Punk |
| Meteor and the Girls | Pop |
| Slim Jim Bites | Blues |

For this purpose , we're going to findout which genres sell the best in USA.

In [105]:
%%sql
WITH 
    invoice_line_track_genre AS (
        SELECT g.name Genre,t.track_id,i.invoice_id, i.invoice_line_id
        FROM genre g
        LEFT JOIN track t ON t.genre_id = g.genre_id
        INNER JOIN invoice_line i ON t.track_id = i.track_id 
    ),
    total_invoice_USA AS (
        SELECT COUNT(i.invoice_id) total
        FROM invoice_line il
        INNER JOIN invoice i ON i.invoice_id = il.invoice_id
        WHERE i.billing_country='USA'
    )

SELECT tg.Genre, 
        COUNT(tg.invoice_line_id) 'Number of tracks',
        ROUND((
                (CAST(COUNT(tg.invoice_line_id) AS FLOAT)*100) / 
                (SELECT * FROM total_invoice_USA)
            ),2) Percentages
FROM invoice_line_track_genre tg
LEFT JOIN invoice i ON i.invoice_id = tg.invoice_id
WHERE i.billing_country='USA'
GROUP BY tg.Genre
ORDER BY Percentages DESC

 * sqlite:///chinook.db
Done.

[('Rock', 561, 53.38),
 ('Alternative & Punk', 130, 12.37),
 ('Metal', 124, 11.8),
 ('R&B/Soul', 53, 5.04),
 ('Blues', 36, 3.43),
 ('Alternative', 35, 3.33),
 ('Pop', 22, 2.09),
 ('Latin', 22, 2.09),
 ('Hip Hop/Rap', 20, 1.9),
 ('Jazz', 14, 1.33),
 ('Easy Listening', 13, 1.24),
 ('Reggae', 6, 0.57),
 ('Electronica/Dance', 5, 0.48),
 ('Classical', 4, 0.38),
 ('Heavy Metal', 3, 0.29),
 ('Soundtrack', 2, 0.19),
 ('TV Shows', 1, 0.1)]

By this result, we can see the tendance of our customers, they like more *Rock 53.38*, *Alternative & Punk 12.37*, *Metal 11.8* but more than half of our customers buy the *Rock* genre. We recommand to purchase the album of **Red Tone**, **Slim Jim Bites** and **Meteor and the Girls** but not **Regal** because the possibility of purchase is too low .

## 2. Analysing Employee Sale Performance

In our store we have a sales support agent who manage the purchases,now we're going to analyse the purchases of customers belonging to each employee. It'll help us to see the performance of the sales support agent.

In [131]:
%%sql
WITH 
    sales_support AS(
        SELECT 
            employee_id,
            last_name||' '||first_name Name,
            city,
            hire_date
        FROM employee
        WHERE title='Sales Support Agent'
    ),
    sales_support_purchases AS (
        SELECT
            s.Name,
            s.city,
            s.hire_date,
            ROUND(SUM(i.total),2) TOTAL
        FROM sales_support s
        LEFT JOIN customer c ON c.support_rep_id = s.employee_id
        INNER JOIN invoice i ON c.customer_id = i.customer_id
        GROUP BY s.employee_id
    )
    
SELECT *
FROM sales_support_purchases s
ORDER BY s.TOTAL DESC

 * sqlite:///chinook.db
Done.

[('Peacock Jane', 'Calgary', '2017-04-01 00:00:00', 1731.51),
 ('Park Margaret', 'Calgary', '2017-05-03 00:00:00', 1584.0),
 ('Johnson Steve', 'Calgary', '2017-10-17 00:00:00', 1393.92)]

By the stat, the best performers is **Peacock Jane** that's because he was the first to be hired.

## 3. Analyzing Sales by Country
In this step, we want to analyze the sales data for customers from each country specially :
- total number of customers
- total value of sales
- average value of sales per customer
- average order value

In [224]:
%%sql
WITH
    countries_other AS (
        SELECT
                CASE 
                    WHEN 
                        (SELECT count(*) 
                        FROM customer 
                        WHERE country = c.country) = 1
                    THEN "Other"
                    ELSE c.country 
                    END AS country,
                c.customer_id,
                il.unit_price,
                il.quantity,
                i.invoice_id
        FROM customer c
        INNER JOIN invoice i ON i.customer_id = c.customer_id
        INNER JOIN invoice_line il ON il.invoice_id = i.invoice_id
    )

SELECT COUNTRY,
        CUSTOMERS,
        TOTAL_SALES,
        LIFESTYLE,
        AVERAGE_ORDER
FROM (
      SELECT country COUNTRY,
            count(DISTINCT customer_id) CUSTOMERS,
            ROUND(SUM(unit_price*quantity),3) TOTAL_SALES,
            ROUND(SUM(unit_price*quantity) / count(DISTINCT customer_id),3) LIFESTYLE,
            ROUND(SUM(unit_price*quantity) / count(DISTINCT invoice_id),3) AVERAGE_ORDER,
            CASE 
                 WHEN country = "Other" THEN 1
                 ELSE 0
            END AS sort
    FROM countries_other
    GROUP BY country
    ORDER BY sort,TOTAL_SALES DESC
)

 * sqlite:///chinook.db
Done.

[('USA', 13, 1040.49, 80.038, 7.943),
 ('Canada', 8, 535.59, 66.949, 7.047),
 ('Brazil', 5, 427.68, 85.536, 7.011),
 ('France', 5, 389.07, 77.814, 7.781),
 ('Germany', 4, 334.62, 83.655, 8.161),
 ('Czech Republic', 2, 273.24, 136.62, 9.108),
 ('United Kingdom', 3, 245.52, 81.84, 8.769),
 ('Portugal', 2, 185.13, 92.565, 6.384),
 ('India', 2, 183.15, 91.575, 8.721),
 ('Other', 15, 1094.94, 72.996, 7.449)]

After studying our result, especially the column **AVERAGE_ORDER** show us that we can have opportinities in the following countries: **Germany**, **Czech Republic**, **United Kingdom**, and **India** . The fact we don't have a lot of informations about those countries so a small investment will be better and by the result we will increase or not .
## 4. Albums vs Individual Tracks
In this part, it's about the purchasing strategy , the management decide to change their strategy to save money. The new strategy consist to buy only the most popular tracks from each album from record companies instead of the whole album. Our job, in this case it's to find out what percentage of purchases are individual tracks vs whole albums, so that management can use this data to understand the effect this decision might have on overall revenue.

In [284]:
%%sql
WITH invoices_track AS 
(
    SELECT il.invoice_id,
            il.track_id
    FROM invoice_line il
    GROUP BY 1
)

SELECT 
        FULL_ALBUM,
        COUNT(FULL_ALBUM) INVOICES,
        ROUND(CAST(
            (COUNT(FULL_ALBUM) *100) AS FLOAT) / (SELECT COUNT(*) FROM invoice), 3
        ) PERCENTAGES
        
FROM (
    SELECT it.*,
           CASE 
                WHEN 
                    (
                        SELECT il1.track_id
                        FROM invoice_line il1
                        WHERE il1.invoice_id = it.invoice_id
                        EXCEPT
                        SELECT t.track_id 
                        FROM track t
                        WHERE t.album_id = (SELECT t1.album_id 
                                            FROM track t1
                                            WHERE t1.track_id = it.track_id)
                    ) IS NULL
                    AND
                    (
                        SELECT t.track_id 
                        FROM track t
                        WHERE t.album_id = (SELECT t1.album_id 
                                            FROM track t1
                                            WHERE t1.track_id = it.track_id)
                        EXCEPT
                        SELECT il1.track_id
                        FROM invoice_line il1
                        WHERE il1.invoice_id = it.invoice_id
                    ) IS NULL
                    THEN "YES"
                    ELSE "NO"
            END AS FULL_ALBUM
    FROM invoices_track it
)
GROUP BY FULL_ALBUM

 * sqlite:///chinook.db
Done.

[('NO', 500, 81.433), ('YES', 114, 18.567)]

Seeing the difference between the percentages, we can draw a conclusion that the customers are not more interesting by purchasing a full album but just picking some tracks. The new strategie match with the result but in the other hand, we've customers who like to buy the full album so buying few albums of the popular artist to satistify those customers.
Let's keep digging in our data base to have more informations for possible opportunities.

## 2. Artist most in playlists

In [299]:
%%sql
WITH 
    tracks_playlist AS (
        SELECT 
                pt.playlist_id, 
                t.track_id, 
                t.album_id
        FROM playlist_track pt
        INNER JOIN track t ON t.track_id = pt.track_id
        
    ),
    artist_playlist AS(
        SELECT 
                ar.name,
                COUNT(DISTINCT t.playlist_id) playlist
        FROM tracks_playlist t
        INNER JOIN album a ON a.album_id = t.album_id
        INNER JOIN artist ar ON ar.artist_id = a.artist_id
        GROUP BY a.artist_id
        ORDER BY playlist DESC
    )
SELECT *
FROM artist_playlist
LIMIT 5

 * sqlite:///chinook.db
Done.

[('Eugene Ormandy', 7),
 ('Berliner Philharmoniker & Herbert Von Karajan', 6),
 ("The King's Singers", 6),
 ('Academy of St. Martin in the Fields & Sir Neville Marriner', 6),
 ('English Concert & Trevor Pinnock', 6)]

## 3. Tracks purchased VS Tracks not purchased

In [353]:
%%sql
WITH tracks AS (
    SELECT track_id
    FROM track
)

SELECT 
        PURCHASED, 
        COUNT(track_id) TOTAL,
        ROUND(
            CAST((COUNT(track_id) * 100)AS FLOAT) / 
        (
            SELECT COUNT(*)
            FROM tracks
        ),3) PERCENTAGES
FROM (
        SELECT track_id,
               CASE 
                    WHEN (
                            SELECT COUNT(*) 
                            FROM invoice_line il 
                            WHERE il.track_id = t.track_id) = 0
                    THEN "NO"
                    ELSE "YES"
                END AS PURCHASED
        FROM tracks t
)
GROUP BY PURCHASED

 * sqlite:///chinook.db
Done.

[('NO', 1697, 48.444), ('YES', 1806, 51.556)]

Result very bad for the companie because only 51.56% of the tracks have been paid. We should research more informations about the tracks purchased.

## 4. Genre most purchased

In [343]:
%%sql
SELECT
       g.name NAME,
     COUNT(il.invoice_line_id) INVOICES
FROM track t
INNER JOIN invoice_line il ON il.track_id = t.track_id
INNER JOIN genre g ON g.genre_id = t.genre_id
GROUP BY g.name
ORDER BY INVOICES DESC

 * sqlite:///chinook.db
Done.

[('Rock', 2635),
 ('Metal', 619),
 ('Alternative & Punk', 492),
 ('Latin', 167),
 ('R&B/Soul', 159),
 ('Blues', 124),
 ('Jazz', 121),
 ('Alternative', 117),
 ('Easy Listening', 74),
 ('Pop', 63),
 ('Electronica/Dance', 55),
 ('Classical', 47),
 ('Reggae', 35),
 ('Hip Hop/Rap', 33),
 ('Heavy Metal', 8),
 ('Soundtrack', 5),
 ('TV Shows', 2),
 ('Drama', 1)]

It's confirmed, our customers are fans of the **Rock** genre. 
## 5. Do protected vs non-protected media

In [360]:
%%sql
WITH 
    tracks AS (
            SELECT 
                    t.track_id,
                    mt.name
            FROM track t
            INNER JOIN media_type mt ON mt.media_type_id = t.media_type_id
),
    invoice_track AS (
            SELECT *
            FROM tracks t1
            INNER JOIN invoice_line il ON t1.track_id = il.track_id
)
SELECT 
        PROTECTED,
        COUNT(PROTECTED) TOTAL,
        ROUND(
            CAST((COUNT(PROTECTED) * 100)AS FLOAT) / 
        (
            SELECT COUNT(*)
            FROM invoice_track
        ),3) PERCENTAGES
FROM (
        SELECT *,
                CASE
                    WHEN name LIKE "Protected%"
                    THEN "YES"
                    ELSE "NO"
                END AS PROTECTED
        FROM invoice_track
        
)
GROUP BY PROTECTED

 * sqlite:///chinook.db
Done.

[('NO', 4315, 90.708), ('YES', 442, 9.292)]

The majority of the purchasing tracks are not protected. This standard must be taken into account when purchasing new tracks.